
## Plan Result (corpus-scheduler-lambda-cdk-production)

[CI link](https://github.com/Pocket/content-monorepo/actions/runs/20112901041)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.corpus-scheduler-sqs-lambda_F2ECDF9F


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.corpus-scheduler-sqs-lambda_F2ECDF9F will be updated in-place
  ~ resource "aws_lambda_function" "corpus-scheduler-sqs-lambda_F2ECDF9F" {
        id                             = "CorpusSchedulerLambda-Prod-SQS-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:CorpusSchedulerLambda-Prod-SQS-Function:264" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:CorpusSchedulerLambda-Prod-SQS-Function:264/invocations" -> (known after apply)
        tags                           = {
            "app_code"       = "content"
            "component_code" = "content-corpusschedulerlambda"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "service"        = "CorpusSchedulerLambda"
        }
      ~ version                        = "264" -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                          = (sensitive value)
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* failed to add a label corpus-scheduler-lambda-cdk-production/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":355,"Program":"tfcmt","SHA1":"3157b6c4b9261c3e1ba95c67c7041d1be6ce5b3f","Target":"corpus-scheduler-lambda-cdk-production","Vars":{},"WorkflowName":"Corpus Scheduler Lambda"} -->